#sorting

In [17]:
import pandas as pd

In [18]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=['A','B','C'])

In [20]:
df.sort_values(by='A',ascending=True)

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [22]:
##we can sort more than one columns
df.sort_values(by = ["A","B"],ascending = [False,False])

   A  B  C
2  7  8  9
1  4  5  6
0  1  2  3

In [24]:
df = pd.DataFrame({
    'Dept': ['IT', 'HR', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 60000, 55000, 58000, 62000]
})

df.groupby("Dept")["Salary"].sum()

Dept
Finance     62000
HR         118000
IT         105000
Name: Salary, dtype: int64

In [25]:
df.groupby('Dept').agg({'Salary': ['mean', 'sum', 'count']})

          Salary
            mean     sum count
Dept
Finance  62000.0   62000     1
HR       59000.0  118000     2
IT       52500.0  105000     2